# سلیب که از کد زدن خسته شده، تصمیم گرفته که به میوه‌خوری روی آورد و تا حد توانش میوه بخورد؛ ولی چون آدم حساسی است، به هر میوه‌ای لب نمی‌زند و فقط میوه‌های خوب را می‌خورد.
#
# میوه‌‌‌ای خوب است که شرایط زیر را داشته باشد:
#
# شکل آن به صورت کروی (sphere) باشد.
# جرم آن بین ۳۰۰ تا ۶۰۰ گرم باشد.
# حجم آن بین ۱۰۰ تا ۵۰۰ سانتی‌متر مکعب باشد.
# توجه کنید که جرم میوه‌های خوب، خود اعداد ۳۰۰ و ۶۰۰ و حجم آن، خود اعداد ۱۰۰ و ۵۰۰ ‌هم می‌تواند باشد.
#
# نکات:
# تابع شما به عنوان ورودی لیستی (tuple) از لغت‌نامه‌‌‌ها‌ (Dictionary) دریافت می‌کند که هر لغت‌نامه اطلاعات مربوط به یک میوه می‌باشد. این تابع در نهایت باید تعداد هر کدام از میوه‌های خوب را در قالب یک لغت‌نامه برگرداند.
# نام و شکل هر میوه به ترتیب با عنوان name و shape و جرم و حجم هر میوه به ترتیب با عنوان mass و volume در یک لغت‌نامه ذخیره شده‌ است.
# شما باید تابع fruits را به‌گونه‌ای تکمیل کنید که لیستی از لغت‌نامه‌ها را دریافت کرده و با توجه به نکات بالا، آن‌ها را مرتب کرده و درنهایت یک لغت‌نامه بصورتی که گفته شد بازگرداند.

x = \
    (
        {'name': 'apple', 'shape': 'sphere', 'mass': 350, 'volume': 120},
        {'name': 'mango', 'shape': 'square', 'mass': 150, 'volume': 120},
        {'name': 'lemon', 'shape': 'sphere', 'mass': 300, 'volume': 100},
        {'name': 'apple', 'shape': 'sphere', 'mass': 500, 'volume': 250}
    )


def fruits(fruit_list):
    dic = dict()
    for i in range(len(fruit_list)):
        main_list = list(fruit_list[i].values())
        print(main_list)
        if main_list[1] == "sphere" and 300 <= main_list[2] <= 600 and 100 <= main_list[3] <= 500:
            if main_list[1] in dic:
                dic[i] += 1
            else:
                dic.update({main_list[0]: 1})
    return dic


print(fruits(x))
