# بزرگانه
# سلیب و سمیرا در حال انجام یک بازی هستند. بازی آن‌ها به این‌صورت است که هر کدام لیستی از نام‌ها را تهیه کرده و به شخص دیگر می‌دهند تا از روی آن بخواند. هرکس که در مدت زمان مشخصی، تعداد نام بیشتری بخواند برنده است و به‌عنوان جایزه، یک ناهار، مهمان علی می‌شود.
#
# از آن‌جایی که سلیب آدم دغل‌کاری است؛‌ تصمیم دارد که در این بازی تقلب کند تا خودش برنده‌ی بازی شود و علی را تیغ بزند.
#
# تقلب اون بدین صورت است که نام‌ها را به صورت ترکیبی از حروف کوچک و بزرگ درآورده است تا خواندن آن‌ها برای سمیرا سخت‌تر شود. اما سمیرا که فرد باهوشی است؛ از شما کمک خواسته تا این نام‌ها را برای او مرتب کنید.
#
# این مرتب‌سازی بدین صورت است که برای هر نام، باید حروف اول هر کلمه‌اش را uppercaseuppercase و باقی حروف آن کلمه را lowercaselowercase کنید. مثلا نام aMIr hosEin پس از تغییرات خواسته شده باید به‌صورت Amir Hosein درآید.
#
# تابعی با نام capitalize بنویسید که لیستی از نام‌ها را به عنوان ورودی دریافت کند و مرتب‌شده‌ی این نام‌ها را به ترتیب و در قالب یک لیست خروجی دهد.
def capitalize(names):
    my_list = []
    for index in names:
        my_list.append(index.title())
    print(my_list)


capitalize(['ali', 'REYHANEH', 'aMIR', 'AMIR abbas', 'Fatemeh Zahra'])
