# جو شرکت رهنما خیلی صمیمی است؛ بدین معنی که در این شرکت همه، از پیر تا جوان، همدیگر را به اسم کوچک صدا می‌زنند. در پی استخدامات بی‌رویه واحد منابع انسانی، به تازگی رهنما با مشکل اساسی تشابه اسمی مواجه شده‌است.
#
# متاسفانه وقتی کسی در شرکت صدا می‌زند «باقر» از آنجایی که تعداد زیادی «باقر» در شرکت مشغول کار‌ هستند، نمی‌توان فهمید که منظورش کدام «باقر» است. بدین منظور مدیر منابع انسانی تصمیم می‌گیرد که برای هر شخص دقیقا یک کلاه‌ رنگی بخرد به طوری که همه کسانی که اسم کوچک مشابهی دارند کلاهی با رنگ متفاوت داشته باشند.
#
# با اینکار تا حدودی مشکل حل می‌شود؛ بدین صورت که از این به بعد کارکنان شرکت به جای اینکه اسم‌ کوچک شخص را صدا بزنند، از ترکیب «اسم کوچک + رنگ» استفاده می‌کنند. مثلا وقتی می‌گوییم «باقر صورتی» می‌دانیم تنها یک «باقر صورتی» داریم و دیگر ابهامی وجود ندارد.
#
# حال مدیر منابع انسانی رهنما از شما خواسته تا با گرفتن نام افراد، حداقل تعداد رنگ‌های مختلف لازم را بدست آورید تا به هر فرد بتوان ترکیب «اسم کوچک + رنگ» یکتایی را متناظر کرد
# ورودی
# در خط اول nn که تعداد کارکنان شرکت رهنما است به شما داده می‌شود.
#
# در nn خط بعدی در هر خط دو رشته متشکل از حروف کوچک الفبای انگلیسی که طول هر یک حداکثر ۱۵ حرف است به شما داده می‌شود که با فاصله از هم جدا شده و به ترتیب، نام و نام خانوادگی کارمند ii ام را نشان می‌دهند. تضمین می‌شود که هیچ دو نفری در رهنما وجود ندارند که نام و نام خانوادگی‌شان دقیقا یکی باشد.
# خروجی
# در تنها خط خروجی حداقل تعداد رنگ‌های مختلف لازم را چاپ کنید.

# test case
# 5
# bagher bagherian
# bagher naderian
# nader bagherian
# nader naderian
# steve jobs
# result
# 2
number = int(input())
lst = list()
for i in range(number):
    lst.append(input().split()[0])
max = 0
for item in lst:
    item_count = lst.count(item)
    if item_count > max:
        max = item_count
print(max)
