# در این سوال می‌خواهیم دو دستور ساده از یک زبان برنامه نویسی را شبیه‌سازی کنیم.
# دستور انتساب
# علامت این دستور := می‌باشد. در سمت چپ این دستور اسم متغیر و در سمت راست آن مقداری که می‌خواهیم در متغیر بریزیم می‌آید. اسم متغیر یک رشته از حروف کوچک انگلیسی با حداکثر ۲۰ حرف است. مقدار متغیر می‌تواند به یکی از دو حالت زیر باشد:
#
# ۱. لیستی از اعداد
# لیستی از اعداد نامنفی با حداکثر ۲۰ عضو که هر کدام از آن‌ها حداکثر ۱۰۰۰ می‌باشد. دقت کنید که بین هر کاراکتر , و عدد بعدی دقیقا یک فاصله قرار گرفته و بین بقیه حروف فاصله‌ای وجود ندارد.
# ۲. لغت‌نامه‌ای از رشته به اعداد
# یک لغت‌نامه از رشته‌های عددی مانند '1' به اعداد مانند 1 می‌باشد. به عبارتی کلیدهای لغت‌نامه از نوع رشته‌ای و مقادیر آن از نوع عددی می‌باشند.
# دستور دوم، دستور print است. این دستور به شکل print var[id] استفاده می‌شود.
#
# بین دستور print و کلمه var یک فاصله وجود دارد. var نام متغیر و id اگر متغیر لیست باشد اندیس خانه‌ و اگر متغیر لغت‌نامه باشد کلید مقداری است که باید چاپ شود. تضمین می‌شود متغیر داده شده قبلا مقداردهی شده است.

# test case
# 4
# a := [1, 2, 3]
# b := {"2": 1, "1": 4, "4": 5}
# print a[1]
# print b["1"]

# result
# 2
# 4
import json

var = dict()
n = int(input())
for i in range(n):
    data = input()
    if ":=" in data:
        key, value = data.split(' := ')
        var[key] = json.loads(value)
    else:
        data = data.split()
        index = data[1]
        index_first = index.index('[')
        index_end = index.index(']')
        index_digit = index[index_first + 1: index_end]
        key = index[:index_first]
        if index_digit.isdigit():
            print(var[key][int(index_digit)])
        else:
            index_digit = index_digit[1:-1]  # get only digit
            print(var[key][index_digit])
