# بازی minesweeperminesweeper از یک جدول m \times nm×n ساخته شده است که در آن بعضی از خانه‌ها حاوی بمب هستند؛ سایر خانه‌ها تعداد بمب‌هایی که در ۸ خانه مجاور آن‌ها قرار دارد را نشان‌ می‌دهند. در این سوال خانه‌های حاوی بمب به شما داده می‌شود. برنامه‌ی شما باید جدول را چاپ کند.
# ورودی
# در خط اول ورودی دو عدد nn و mm داده می‌شود که به ترتیب نشان دهنده‌ی تعداد سطر و ستون‌های جدول است. سپس در خط بعد عدد kk وارد می‌شود که تعداد بمب‌های واقع در جدول را نشان می‌دهد. در نهایت در هر خط از kk خط بعدی، یک زوج عدد که مکان بمب‌ها را نشان می‌دهند به عنوان ورودی به برنامه داده می‌شوند. در هر زوج ابتدا شماره سطر و سپس ستون مربوطه نمایش داده می‌شود. جدول را طوری فرض کنید که ستون‌های آن از چپ به راست با اعداد ۱ تا mm و سطرهای آن از بالا به پایین با اعداد طبیعی ۱ تا nn شماره‌گذاری شده‌اند.
# خروجی
# برنامه باید در خروجی یک جدول m \times nm×n را چاپ کند. به این صورت که به ازای بمب‌ها نماد * و برای سایر خانه‌های جدول نیز عدد متناظر با آن را چاپ کند. بین هر دو عنصر متوالی در یک سطر، یک فاصله (Space) چاپ‌ کرده که آن‌ها را از هم جدا کند.
# test case
# 4 3
# 5
# 1 1
# 1 3
# 3 2
# 4 2
# 4 3

# result
# * 2 *
# 2 3 2
# 2 * 3
# 2 * *

def check_pos(x, y, m, n):
    pos = [-1, 0, 1]
    if maps[x][y] != '*':
        for i in pos:
            for j in pos:
                if i != 0 or j != 0:
                    if (0 <= x + i < m) and (0 <= y + j < n):
                        if maps[x + i][y + j] == '*':
                            maps[x][y] += 1
    return maps


def print_list(my_list):
    for item in my_list:
        print(*item)


m, n = map(int, input().split())
k = int(input())
maps = []
for i in range(m):
    maps.append([])
    for j in range(n):
        maps[i].append(0)

for i in range(k):
    bombLocation = input().split()
    maps[int(bombLocation[0]) - 1][int(bombLocation[1]) - 1] = '*'

for i in range(0, m):
    for j in range(0, n):
        check_pos(i, j, m, n)
print_list(maps)
