# اعتبارسنجی داده‌های ورودی یکی از حیاتی‌ترین بخش‌های هر وب‌سایت است، چرا که اگر اعتبارسنجی‌ای صورت نگیرد، ممکن است وب‌سایت در برابر مسائل امنیتی متعددی آسیب‌پذیر شود. این داده‌ها معمولاً شامل آدرس ایمیل و شماره موبایل هستند.
#
# دو تابع با نام‌های validate_email و validate_phone که به ترتیب اعتبارسنجی آدرس ایمیل و شماره موبایل را انجام می‌دهند پیاده‌سازی کنید. خروجی این توابع باید از نوع bool باشد. در صورتی که داده‌ی ورودی معتبر باشد، مقدار True و در غیر این‌صورت، مقدار False را برگردانید.
#
# قوانین اعتبارسنجی
# اعتبارسنجی آدرس ایمیل
# یک آدرس ایمیل معتبر به شکل username@domain.tld است، به‌طوری که:
#
# نام کاربری (username) تنها از کاراکتر انگلیسی، عدد، آندرلاین و نقطه تشکیل شده است.
# دامنه (domain) تنها از کاراکتر انگلیسی یا عدد تشکیل شده است.
# tld یک واژه‌ی سه‌حرفی از کاراکترهای انگلیسی است.
# کاراکترهای انگلیسی می‌توانند کوچک یا بزرگ باشد.
# اعتبارسنجی شماره موبایل
# یک شماره موبایل در صورتی معتبر است که یکی از حالت‌های زیر را دارا باشد:
#
# شامل ۱۱ کاراکتر باشد و با 09 آغاز شود.
# شامل ۱۳ کاراکتر باشد و با +989 آغاز شود.
# شامل ۱۴ کاراکتر باشد و با 00989 آغاز شود.

import re


def validate_email(email):
    if re.match(r'^[A-zA-Z1-9\.\_]+@[A-zA-Z1-9]+\.[A-zA-Z]{3}$', email):
        return True
    else:
        return False


def validate_phone(number):
    if re.match(r'^[[\+989]?[00989]?[09]?][0-9]{9}$', number):
        return True
    else:
        return False


# email = 'sample@school.edu'
# print(validate_email(email))
phone = '09215546321'
print(validate_phone(phone))
