# از شما می‌خواهیم که یک تابع به نام get_func(ls) بنویسید که یک لیست از رشته‌ها (که نام اشکال مختلف دو بعدی هستند) ورودی می‌گیرد. برای هر رشته تابع محاسبه‌گر مساحت آن را به دست آورده و به همان ترتیب لیست ورودی در لیستی جدید ذخیره کرده و خروجی می‌دهد.
#
# توابع محاسبه‌گر مساحت
# مربع: تابع محاسبه‌گر مساحت مربع، فقط یک آرگومان دارد و آن طول ضلع مربع است. خروجی آن مساحت مربع بر اساس طول داده شده است.
# دایره: تابع محاسبه‌گر مساحت دایره، شعاع دایره را به عنوان آرگومان گرفته و مساحت دایره را خروجی می‌دهد.
# مستطیل: تابع محاسبه‌گر مساحت مستطیل، دو آرگومان طول و عرض را گرفته و مساحت مستطیل را خروجی می‌دهد.
# مثلث: تابع محاسبه‌گر مثلث، دو آرگومان ارتفاع و قاعده را گرفته و مساحت مثلث را خروجی می‌دهد.

# test case
# ls = get_func(['square', 'circle', 'rectangle', 'triangle'])
#
# print(ls[0](1))
# print(ls[1](2))
# print(ls[2](2, 4))
# print(ls[3](4, 5))

import math


def get_func(arr):
    switcher = {
        "square": lambda x: x * x,
        "circle": lambda x: x ** 2 * math.pi,
        "rectangle": lambda x, y: x * y,
        "triangle": lambda x, y: x * y * 0.5,
    }
    return [switcher.get(shape) for shape in arr]
